Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleOverrides.SetDirectContext3DHandleSettings(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleSettings)
Assigns override settings associated with a DirectContext3D handle instance or type.
aDoc:
Document where elementId resides.
elementId:
Id of the element to be overridden.
newSettings:
The override settings to be assigned to the handle element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ElementId elementId is not a valid DirectContext3D handle instance or type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018

Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleOverrides.GetDirectContext3DHandleSettings(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Gets override settings associated with a DirectContext3D handle instance or type.
aDoc:
Document where elementId resides.
elementId:
Id of the overridden element.
Returns:
The override settings assigned to the handle element, if present, or a default override settings if nothing was found.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ElementId elementId is not a valid DirectContext3D handle instance or type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018

Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleOverrides.Assign(Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleOverrides)
Assigns values of the source overrides to this object.
other:
The source overrides.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018

Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleOverrides.IsEqual(Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleOverrides)
Check if the contents of two overrides are equal.
other:
The overrides to be compared.
Returns:
True for equal, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018